app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
              <span class="glyphicon glyphicon-calendar"></span><%=@post.created_at%>
              | <span class="glyphicon glyphicon-comment"></span><%=@post.comments.count%> Comments