app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "12"], ["created_at", Fri, 13 Dec 2013 03:10:40 UTC +00:00], ["post_id", 3], ["updated_at", Fri, 13 Dec 2013 03:10:40 UTC +00:00]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = 10  [["user_id", 1], ["updated_at", Fri, 13 Dec 2013 07:45:33 UTC +00:00]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create!(comment_params)
		@comment.user = current_user
		@comment.save