app/controllers/posts_controller.rb

  def index
    if params[:keyword].present?
      @posts = Post.search(params[:keyword]).to_set + Post.tagged_with(params[:keyword])
      @type = "search"
      @keyword = params[:keyword]
    elsif  params[:tag].present?
      @posts = Post.tagged_with(params[:tag])
      @type = "tag"
      @tag = params[:tag]
    else
      @posts = Post.all
    end
    #@posts = Post.where(:user_id => current_user.id)
    @posts = Post.page(params[:page]).per 5
---
SELECT "posts".* FROM "posts" ORDER BY id desc
SELECT "posts".* FROM "posts" ORDER BY id desc LIMIT 2 OFFSET 0

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "aaaaaaaaaaaaaaaaaaaaaaaaa"], ["created_at", Thu, 12 Dec 2013 10:53:40 UTC +00:00], ["title", "abcd"], ["updated_at", Thu, 12 Dec 2013 10:53:40 UTC +00:00], ["user_id", 1]]